Tekla Open API Reference for Tekla Structures 2025
AttributeTypeNameEditor Methods
The AttributeTypeNameEditor type exposes the following members.
Methods
Name | Description
EditValue
 Edits the specified object's value using the editor style indicated by the GetEditStyle method.
 (Overrides UITypeEditor.EditValue(ITypeDescriptorContext, IServiceProvider, Object).)
GetEditStyle
 Gets the editor style used by the EditValue method.
 (Overrides UITypeEditor.GetEditStyle(ITypeDescriptorContext).)
Top
See Also
Reference
AttributeTypeNameEditor Class
Tekla.Structures.Dialog Namespace